kuzlab/core-s3se-weather/sdkconfig.defaults
# Target / flash --------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM: CoreS3 SE has 8MB Quad PSRAM. LVGL draw buffers live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Console: CoreS3 SE exposes the ESP32-S3 native USB-Serial-JTAG
# (VID 0x303a / PID 0x1001), not an external USB-UART bridge.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Tasks / timing --------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# TLS: certificate verification via the bundled root CA store (SPEC §3.1).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_INSECURE=n

# LVGL v9 -----------------------------------------------------------------
# Note: LV_COLOR_16_SWAP no longer exists in v9. The byte swap the ILI9342C
# needs is done by esp_lvgl_port's swap_bytes flag instead (see main/ui.c).
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n

# SNTP: two servers, so a single unreachable one does not stall the clock.
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# TLS memory -------------------------------------------------------------
# The first HTTPS handshake succeeded and every later one failed with
# MBEDTLS_ERR_RSA_PUBLIC_FAILED + MBEDTLS_ERR_MPI_ALLOC_FAILED (0x4290) --
# an out-of-memory during RSA verification, not a crypto fault. Wi-Fi and
# LVGL leave little internal RAM, and mbedtls allocates from it by default.
# There is 8MB of PSRAM, so send mbedtls there and let it release the large
# TLS buffers between connections.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
# Inbound stays large enough for a full certificate chain; outbound only
# ever carries a short GET.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
